# WillRuleCheckElements Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..WillRuleCheckElements Method (Int32)
PerformanceAdviser Class See Also
---
Reports if rule needs to be executed on individual elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool WillRuleCheckElements(
	int index
)
```

Visual Basic
---
```text
Public Function WillRuleCheckElements ( _
	index As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool WillRuleCheckElements(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The rule index to get information for.
# ### Return Value
True if rule needs to be executed on individual elements.
# See Also
PerformanceAdviser Class
WillRuleCheckElements Overload
Autodesk.Revit.DB Namespace